ConfigurationSale/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationSale/src/Documents/РеализацияТоваров/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РассчитатьСумму(ТекущиеДанные);
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РассчитатьСумму(ТекущиеДанные);
EndProcedure

&AtClient
Procedure РассчитатьСумму(ТекущиеДанные)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	
EndProcedure
